In [20]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [2]:
df = pd.read_csv(r'G:\Machine Learning\jupyter csv files\titanic.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','Ticket','Embarked','Parch','SibSp','Cabin'],axis='columns',inplace = True )
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df['Survived']
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [5]:
inputs = df.drop(['Survived'],axis = "columns")
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [6]:
dv = pd.get_dummies(df['Sex'])
dv.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [7]:
inputs = pd.concat([inputs,dv],axis = 'columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs = inputs.drop(['Sex'],axis = 'columns')
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [12]:
inputs.columns[inputs.isna().any()]   #here we need to check whether any column as nan value

Index(['Age'], dtype='object')

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [24]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size = 0.2)

In [25]:
model = GaussianNB()
model

GaussianNB()

In [26]:
model.fit(X_train,y_train)

GaussianNB()

In [28]:
model.score(X_test,y_test)

0.7988826815642458

In [29]:
X_test[:10]

     Pclass        Age     Fare  female  male
547       2  29.699118  13.8625       0     1
128       3  29.699118  22.3583       1     0
591       1  52.000000  78.2667       1     0
92        1  46.000000  61.1750       0     1
359       3  29.699118   7.8792       1     0
132       3  47.000000  14.5000       1     0
514       3  24.000000   7.4958       0     1
427       2  19.000000  26.0000       1     0
727       3  29.699118   7.7375       1     0
364       3  29.699118  15.5000       0     1

In [30]:
y_test[:10]

547    1
128    1
591    1
92     0
359    1
132    0
514    0
427    1
727    1
364    0
Name: Survived, dtype: int64

In [31]:
model.predict(X_test[:10])

array([0, 1, 1, 0, 1, 1, 0, 1, 1, 0], dtype=int64)